[
  {
    "name": "PARA (Paste and Run Anything)",
    "text": [
            "PARA is a team project developed in close collaboration of Jetbrains (our client). We built an Intellij plugin that automatically installs missing java dependencies. The plugin compares a semantic/database-driven approach with an AI-based approach for resolving unresolved methods and classes.",
            "My noteable contributions: ",
            " Implemented Java parsing using Intellij's PSI tree to identify and classify unresolved classes and methods, as well as determining class owner ship of unresolved methods; ", 
            " Designed initial project structure, and integrated all core action listeners; ",
            " Developed Unit tests and tests classes to validate all my implementations.",
            "Team achievements: ",
            " Collaborated closely with Jebrain engineers, holding weekly meetings to align requirements and technical direction; ",
            " Received a 9/10 evaluation from Jetbrains.",
            "Note: Source code cannot be shared due to NDA restrictions."
    ],
    "exp": [
        " Kotlin",
        " JAVA",
        " Gradle",
        " Maven",
        " SCRUM",
        "󰴒 Design Patterns",
        " Intellij SDK",
        " Plugin Development",
        " Git"
    ]
  },
  {
    "name": "nowaymouse",
    "text": [
            "nowaymouse is a Open-Source tool developed by me in Go and Python, designed to provide smooth and precise keyboard-driven control over the mouse pointer on wlroots based wayland compositors, such as Sway, Hyprland, and Wayfire. ",
            "Key Features: ",
            " Keyboard control: It enables users to control precise mouse movements and actions (clicks and scrolls) via key strokes;",
            " Grid navigation: It displays a triggerable overlay that divides the screen into segments, allowing pointer snapping to grids mapped to specific keys;",
            " Customizable UX: Offers flexible key bindings and overlay visuals through user configuration.",
            "For more detailed visual showcase of the project, please visit the github page linked below."
    ],
    "exp": [
        "󰟓 Go",
        " Python",
        " Git"
    ],
    "links": [
      { "href": "https://github.com/Neal-Ning/nowaymouse", "text": " GitHub: nowaymouse", "sc": "g" },
      { "href": "https://aur.archlinux.org/packages/nowaymouse-git", "text": "󰣇 AUR Repo: nowaymouse-git", "sc": "a" }
    ]
  },
  {
    "name": "Serpentine",
    "text": [
            "Serpentine is an association and student team focused on Artificial Intelligence. I am a member of the on-going Artificial Intelligence for Motor Imagery (AIMI) project team, exploring and contributing to AI-driven technologies that empower physically impaired individuals to perform tasks independently.",

            "Key contributions: ",
            " Fine tunned and enhanced performance of models developed by peers;", 
            " Compared different models architectures to idenfity most effective apporaches;",
            " Researched, designed and refined a custom model;",
            " Presented the project at the Dutch Design Week."
    ],
    "exp": [
        " Student Team",
        " Python",
        " PyTorch",
        "󱑽 Signal Processing",
        "󰗣 Weights and Biases"
    ],
    "links": [
      { "href": "https://serpentine.ai/", "text": "Website: serpentine.ai", "sc": "s" }
    ]
  }
]
